SET FOREIGN_KEY_CHECKS = 0;

INSERT INTO purchase_orders (id, order_no, supplier_id, warehouse_id, type, status, total_amount, delivery_date, created_by, biz_no, biz_type, city, contact_name, contact_phone, detail_address, is_from_stock_in, is_manual_address, platform_order_no, province, settlement_status, shipping_status, cost_type, created_at, updated_at) VALUES
(140, 'C202603311119004', 2, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110001', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110001', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(141, 'C202603311119005', 1, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110003', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110003', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(142, 'C202603311119003', 2, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110002', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110002', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(143, 'C202603311119002', 1, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110005', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110005', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(144, 'C202603311119001', 1, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110004', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110004', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(145, 'C202603311119006', 2, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110006', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110006', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(146, 'C202603311119007', 1, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110007', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110007', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(147, 'C202603311119008', 2, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110008', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110008', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(148, 'C202603311119009', 1, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110009', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110009', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(149, 'C202603311119010', 2, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311110010', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311110010', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:19:07', '2026-03-31 11:19:07'),
(150, 'C202603311123001', 1, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311120001', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311120001', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:23:35', '2026-03-31 11:23:35'),
(151, 'C202603311123002', 2, 1, 'INBOUND', 'CONFIRMED', 3.00, '2026-04-01', 'admin', 'IN202603311120002', 'INBOUND', '东城区', 'admin', '13800138000', '萨大师大师大师', 1, 0, '入库采购-IN202603311120002', '北京市', 'UNSETTLED', 'TO_SHIP', 'PLATFORM', '2026-03-31 11:23:35', '2026-03-31 11:23:35');

INSERT INTO inbound_orders (id, inbound_no, purchase_order_id, warehouse_id, status, inbound_date, created_at, updated_at, city, contact_name, contact_phone, detail_address, district, province) VALUES
(15718, 'IN202603311110001', 140, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15719, 'IN202603311110003', 141, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15720, 'IN202603311110002', 142, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15721, 'IN202603311110005', 143, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15722, 'IN202603311110004', 144, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15723, 'IN202603311110006', 145, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15724, 'IN202603311110007', 146, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15725, 'IN202603311110008', 147, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15726, 'IN202603311110009', 148, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15727, 'IN202603311110010', 149, 1, 'RECEIVED', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '2026-03-31 11:19:07', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15728, 'IN202603311120001', 150, 1, 'RECEIVED', '2026-03-31 11:23:35', '2026-03-31 11:23:35', '2026-03-31 11:23:35', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市'),
(15729, 'IN202603311120002', 151, 1, 'RECEIVED', '2026-03-31 11:23:35', '2026-03-31 11:23:35', '2026-03-31 11:23:35', '东城区', 'admin', '13800138000', '萨大师大师大师', '东城区', '北京市');

SET FOREIGN_KEY_CHECKS = 1;
